app/Controllers/Bidan.php

    public function index()
    {
        $currentPage = $this->request->getVar('page_bidan') ? $this->request->getVar('page_bidan') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword){
            $bidan = $this->bidanModel->search($keyword);
        }else{
            $bidan = $this->bidanModel;
        }

        $data  = [
            'bidan' => $bidan->paginate(5, 'bidan'),
            'pager' => $this->bidanModel->pager,
            'currentPage' => $currentPage,
            'bidan' => $this->bidanModel->getBidan()
        ];
---
SELECT *
FROM `bidan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `bidan`