app/Models/BidanModel.php

SELECT *
FROM `bidan`
SELECT *
FROM `bidan`
WHERE `bidannama` = ' Lisa Khafifah'
 LIMIT 1
---
    public function getBidan($bidannama = false)
    {
        if($bidannama == false){
            return $this->findAll();
        }
        return $this->where(['bidannama' => $bidannama])->first();